{
    "testimonials": [{
            "text": "Very clean and most machines are kept in good working condition. Not crowded and has lots of options.",
            "name": "Tina B."
        },
        {
            "text": "Small convenience store attached to laundromat. Bathroom on site. There was a guy there constantly cleaning and making sure everything was in order. Couldn't ask for more.",
            "name": "Rochelle F."
        },
        {
            "text": "I went on Google last night and scoped out what laundromats were near UCR, considering I am a student there. The facilities were really clean and really satisfactory. The prices are incredibly reasonable.",
            "name": "Bradford C."
        },
        {
            "text": "Clean, quiet, not overcrowded. Small convenience store attached to laundromat. Bathroom on site. There was a guy there constantly cleaning and making sure everything was in order. Couldn't ask for more.",
            "name": "Christian P."
        },
        {
            "text": "I went on Google last night and scoped out what laundromats were near UCR, considering I am a student there. The facilities were really clean and really satisfactory. The prices are incredibly reasonable. The washer beyond exceeded my expectations. I don't  know what the machines are made of, but the washers are miracle workers. The stains got off and the shorts look the same way they did when I bought them.",
            "name": "Tulsi M."
        },
        {
            "text": "This place is clean and maintained. Clothes get washed well and there's even a place where you can fold them. Staff is friendly and generous. I don't have a washer at my house, so I come here every two weeks and never had a problem. There are no long waits either :)",
            "name": "Abraham G."
        },
        {
            "text": "This place was nice and clean. It's not too far from my place. Price is good and you can use quarters to wash & dry. Laundry cards are annoying. I just needed to wash one load., so $1.25 to wash & 50 cents (25 cents per 10min) to dry my stuff was great. I'm sure I'll be back to wash again.",
            "name": "Sergio S."
        },
        {
            "text": "This place gets the job done and not to mention is fairly cheap.",
            "name": "Lola Patricia Aguiar."
        },
        {
            "text": "I love it when it's just me doing laundry :):):)",
            "name": "Ken Yousif"
        },
        {
            "text": "It was good. Very small place. Person working here seemed friendly and offered me assistance if i needed.",
            "name": "Michael Miller"
        }
    ]
}
